In [4]:
import seaborn as sns
import numpy as np
import pandas as pd
titanic = sns.load_dataset('titanic')
titanic.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [14]:
titanic['pclass'].value_counts()

pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [15]:
data = {
    '이름': ['김철수', '이영희', '박민수', '정지영'],
    '나이': [25, 28, 22, 30],
    '성별': ['남', '여', '남', '여'],
    '점수': [85, 92, 78, 90]
}
df1 = pd.DataFrame(data)
print("딕셔너리로부터 DataFrame 생성:")
print(df1)

딕셔너리로부터 DataFrame 생성:
    이름  나이 성별  점수
0  김철수  25  남  85
1  이영희  28  여  92
2  박민수  22  남  78
3  정지영  30  여  90

In [36]:
titanic['sex'].describe
titanic.set_index('age')
titanic.loc[20]

survived                 0
pclass                   2
sex                   male
age                   35.0
sibsp                    0
parch                    0
fare                  26.0
embarked                 S
class               Second
who                    man
adult_male            True
deck                   NaN
embark_town    Southampton
alive                   no
alone                 True
Name: 20, dtype: object

In [47]:
df2 = df1.set_index('이름')
df2.loc["김철수"]

나이    25
성별     남
점수    85
Name: 김철수, dtype: object

In [51]:
# 딕셔너리로부터 DataFrame 생성
data = {
    '이름': ['김철수', '이영희', '박민수', '정지영'],
    '나이': [25, 28, 22, 30],
    '성별': ['남', '여', '남', '여'],
    '점수': [85, 92, 78, 90]
}
df1 = pd.DataFrame(data)
print("딕셔너리로부터 DataFrame 생성:")
print(df1)

# 리스트의 리스트로부터 DataFrame 생성
data_list = [
    ['김철수', 25, '남', 85],
    ['이영희', 28, '여', 92],
    ['박민수', 22, '남', 78],
    ['정지영', 30, '여', 90]
]
df2 = pd.DataFrame(data_list, columns=['이름', '나이', '성별', '점수'])
print("\n리스트로부터 DataFrame 생성:")
print(df2)

딕셔너리로부터 DataFrame 생성:
    이름  나이 성별  점수
0  김철수  25  남  85
1  이영희  28  여  92
2  박민수  22  남  78
3  정지영  30  여  90

리스트로부터 DataFrame 생성:
    이름  나이 성별  점수
0  김철수  25  남  85
1  이영희  28  여  92
2  박민수  22  남  78
3  정지영  30  여  90

In [72]:
df_multi = df1.set_index(['성별','이름'])
df_set = df1.set_index('이름')
df2 = df_set.rename_axis('학생명')
df2
df2 = df1.set_index('이름')
df2.loc[['김철수','이영희'],['나이','성별']]

     나이 성별
이름
김철수  25  남
이영희  28  여

In [94]:
mask = df1['나이'] >= 25
df1['점수'].mean()
df1['점수'].median()
df1['점수'].std()
df1['점수'].min()
df1['점수'].max()
df1['점수'].sum()
stat = df1.groupby('성별').agg({
    '점수': ['mean','max','min'],
    '나이': ['mean', 'max', 'min']
})
stat

      점수            나이
    mean max min  mean max min
성별
남   81.5  85  78  23.5  25  22
여   91.0  92  90  29.0  30  28

In [95]:
import pandas as pd
import matplotlib.pyplot as plt

# 온라인 쇼핑몰 고객 데이터 (가상)
customer_data = {
    '고객ID': [1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009, 1010],
    '이름': ['김민수', '이지영', '박철호', '정수민', '최영희', '강도현', '윤서연', '임태혁', '송지원', '한미래'],
    '나이': [25, 32, 28, 35, 29, 31, 26, 33, 27, 30],
    '성별': ['남', '여', '남', '여', '여', '남', '여', '남', '여', '여'],
    '구매금액': [50000, 75000, 32000, 98000, 67000, 84000, 41000, 72000, 58000, 89000],
    '구매횟수': [3, 5, 2, 7, 4, 6, 2, 5, 3, 6],
    '회원등급': ['실버', '골드', '브론즈', '플래티넘', '골드', '골드', '실버', '골드', '실버', '플래티넘']
}

df = pd.DataFrame(customer_data)
print("온라인 쇼핑몰 고객 데이터:")
print(df)

온라인 쇼핑몰 고객 데이터:
   고객ID   이름  나이 성별   구매금액  구매횟수  회원등급
0  1001  김민수  25  남  50000     3    실버
1  1002  이지영  32  여  75000     5    골드
2  1003  박철호  28  남  32000     2   브론즈
3  1004  정수민  35  여  98000     7  플래티넘
4  1005  최영희  29  여  67000     4    골드
5  1006  강도현  31  남  84000     6    골드
6  1007  윤서연  26  여  41000     2    실버
7  1008  임태혁  33  남  72000     5    골드
8  1009  송지원  27  여  58000     3    실버
9  1010  한미래  30  여  89000     6  플래티넘

In [182]:
df.fillna(0)
fill_values = {
    '이름':'익명',
    '나이': 20,
    '성별': '미입력',
    '직업':'기타',
    '급여':df['급여'].mean()
}
df.fillna(fill_values)
df.ffill()
df.bfill()

    이름    나이 성별   직업      급여
0  김철수  25.0  남  회사원  3500.0
1  이영희  28.0  여  자영업  4200.0
2  박민수  30.0  남  자영업  3800.0
3  정지영  30.0  여  공무원  3800.0
4  정지영  22.0  여  회사원  3200.0

In [125]:
row_count, col_count = df.shape
print(list(df.columns))
df[['나이','구매금액','구매횟수']].describe()
df['성별'].value_counts()
df['회원등급'].value_counts()

['고객ID', '이름', '나이', '성별', '구매금액', '구매횟수', '회원등급']

회원등급
골드      4
실버      3
플래티넘    2
브론즈     1
Name: count, dtype: int64

In [166]:

import numpy as np
import pandas as pd

data = {
    '이름': ['김철수', '이영희', '박민수', np.nan, '정지영'],
    '나이': [25, 28, np.nan, 30, 22],
    '성별': ['남', '여', '남', np.nan, '여'],
    '직업': ['회사원', np.nan, '자영업', '공무원', '회사원'],
    '급여': [3500, 4200, np.nan, 3800, 3200]
}

df = pd.DataFrame(data)

In [ ]:
df1 = df.groupby('성별')
df1['급여'].mean()

성별
남    3500.0
여    3700.0
Name: 급여, dtype: float64

NameError: name 'time_data' is not defined

In [154]:
df.describe()

          나이           급여
count   4.00     4.000000
mean   26.25  3675.000000
std     3.50   427.200187
min    22.00  3200.000000
25%    24.25  3425.000000
50%    26.50  3650.000000
75%    28.50  3900.000000
max    30.00  4200.000000

In [146]:
mask = df['회원등급'].isin(['실버','플래티넘'])
df[mask]
gender_group = df.groupby('성별')
gender_group['구매금액'].agg(['mean','max'])

            mean    max
성별
남   59500.000000  84000
여   71333.333333  98000